luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxFlash_bf.h
/** \brief  Length for Ifx_FLASH_CBAB_STAT_Bits.VLD6 */
#define IFX_FLASH_CBAB_STAT_VLD6_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_STAT_Bits.VLD6 */
#define IFX_FLASH_CBAB_STAT_VLD6_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_STAT_Bits.VLD6 */
#define IFX_FLASH_CBAB_STAT_VLD6_OFF (6u)

/** \brief  Length for Ifx_FLASH_CBAB_STAT_Bits.VLD7 */
#define IFX_FLASH_CBAB_STAT_VLD7_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_STAT_Bits.VLD7 */
#define IFX_FLASH_CBAB_STAT_VLD7_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_STAT_Bits.VLD7 */
#define IFX_FLASH_CBAB_STAT_VLD7_OFF (7u)

/** \brief  Length for Ifx_FLASH_CBAB_STAT_Bits.VLD8 */
#define IFX_FLASH_CBAB_STAT_VLD8_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_STAT_Bits.VLD8 */
#define IFX_FLASH_CBAB_STAT_VLD8_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_STAT_Bits.VLD8 */
#define IFX_FLASH_CBAB_STAT_VLD8_OFF (8u)

/** \brief  Length for Ifx_FLASH_CBAB_STAT_Bits.VLD9 */
#define IFX_FLASH_CBAB_STAT_VLD9_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_STAT_Bits.VLD9 */
#define IFX_FLASH_CBAB_STAT_VLD9_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_STAT_Bits.VLD9 */
#define IFX_FLASH_CBAB_STAT_VLD9_OFF (9u)

/** \brief  Length for Ifx_FLASH_CBAB_TOP_Bits.ADDR */
#define IFX_FLASH_CBAB_TOP_ADDR_LEN (19u)

/** \brief  Mask for Ifx_FLASH_CBAB_TOP_Bits.ADDR */
#define IFX_FLASH_CBAB_TOP_ADDR_MSK (0x7ffffu)

/** \brief  Offset for Ifx_FLASH_CBAB_TOP_Bits.ADDR */
#define IFX_FLASH_CBAB_TOP_ADDR_OFF (5u)

/** \brief  Length for Ifx_FLASH_CBAB_TOP_Bits.CLR */
#define IFX_FLASH_CBAB_TOP_CLR_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_TOP_Bits.CLR */
#define IFX_FLASH_CBAB_TOP_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_TOP_Bits.CLR */
#define IFX_FLASH_CBAB_TOP_CLR_OFF (31u)

/** \brief  Length for Ifx_FLASH_CBAB_TOP_Bits.ERR */
#define IFX_FLASH_CBAB_TOP_ERR_LEN (6u)

/** \brief  Mask for Ifx_FLASH_CBAB_TOP_Bits.ERR */
#define IFX_FLASH_CBAB_TOP_ERR_MSK (0x3fu)

/** \brief  Offset for Ifx_FLASH_CBAB_TOP_Bits.ERR */
#define IFX_FLASH_CBAB_TOP_ERR_OFF (24u)

/** \brief  Length for Ifx_FLASH_CBAB_TOP_Bits.VLD */
#define IFX_FLASH_CBAB_TOP_VLD_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_TOP_Bits.VLD */
#define IFX_FLASH_CBAB_TOP_VLD_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_TOP_Bits.VLD */
#define IFX_FLASH_CBAB_TOP_VLD_OFF (30u)

/** \brief  Length for Ifx_FLASH_COMM0_Bits.STATUS */
#define IFX_FLASH_COMM0_STATUS_LEN (8u)

/** \brief  Mask for Ifx_FLASH_COMM0_Bits.STATUS */
#define IFX_FLASH_COMM0_STATUS_MSK (0xffu)

/** \brief  Offset for Ifx_FLASH_COMM0_Bits.STATUS */
#define IFX_FLASH_COMM0_STATUS_OFF (0u)

/** \brief  Length for Ifx_FLASH_COMM1_Bits.DATA */
#define IFX_FLASH_COMM1_DATA_LEN (8u)

/** \brief  Mask for Ifx_FLASH_COMM1_Bits.DATA */
#define IFX_FLASH_COMM1_DATA_MSK (0xffu)

/** \brief  Offset for Ifx_FLASH_COMM1_Bits.DATA */
#define IFX_FLASH_COMM1_DATA_OFF (8u)

/** \brief  Length for Ifx_FLASH_COMM1_Bits.STATUS */
#define IFX_FLASH_COMM1_STATUS_LEN (8u)

/** \brief  Mask for Ifx_FLASH_COMM1_Bits.STATUS */
#define IFX_FLASH_COMM1_STATUS_MSK (0xffu)

/** \brief  Offset for Ifx_FLASH_COMM1_Bits.STATUS */
#define IFX_FLASH_COMM1_STATUS_OFF (0u)

/** \brief  Length for Ifx_FLASH_COMM2_Bits.DATA */
#define IFX_FLASH_COMM2_DATA_LEN (8u)

/** \brief  Mask for Ifx_FLASH_COMM2_Bits.DATA */
#define IFX_FLASH_COMM2_DATA_MSK (0xffu)

/** \brief  Offset for Ifx_FLASH_COMM2_Bits.DATA */
#define IFX_FLASH_COMM2_DATA_OFF (8u)

/** \brief  Length for Ifx_FLASH_COMM2_Bits.STATUS */
#define IFX_FLASH_COMM2_STATUS_LEN (8u)

/** \brief  Mask for Ifx_FLASH_COMM2_Bits.STATUS */
#define IFX_FLASH_COMM2_STATUS_MSK (0xffu)

/** \brief  Offset for Ifx_FLASH_COMM2_Bits.STATUS */
#define IFX_FLASH_COMM2_STATUS_OFF (0u)

/** \brief  Length for Ifx_FLASH_ECCRD_Bits.ECCORDIS */
#define IFX_FLASH_ECCRD_ECCORDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ECCRD_Bits.ECCORDIS */
#define IFX_FLASH_ECCRD_ECCORDIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ECCRD_Bits.ECCORDIS */
#define IFX_FLASH_ECCRD_ECCORDIS_OFF (31u)

/** \brief  Length for Ifx_FLASH_ECCRD_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRD_EDCERRINJ_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ECCRD_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRD_EDCERRINJ_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ECCRD_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRD_EDCERRINJ_OFF (30u)

/** \brief  Length for Ifx_FLASH_ECCRD_Bits.RCODE */
#define IFX_FLASH_ECCRD_RCODE_LEN (22u)

/** \brief  Mask for Ifx_FLASH_ECCRD_Bits.RCODE */
#define IFX_FLASH_ECCRD_RCODE_MSK (0x3fffffu)

/** \brief  Offset for Ifx_FLASH_ECCRD_Bits.RCODE */
#define IFX_FLASH_ECCRD_RCODE_OFF (0u)

/** \brief  Length for Ifx_FLASH_ECCRP_Bits.ECCORDIS */
#define IFX_FLASH_ECCRP_ECCORDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ECCRP_Bits.ECCORDIS */
#define IFX_FLASH_ECCRP_ECCORDIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ECCRP_Bits.ECCORDIS */
#define IFX_FLASH_ECCRP_ECCORDIS_OFF (31u)

/** \brief  Length for Ifx_FLASH_ECCRP_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRP_EDCERRINJ_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ECCRP_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRP_EDCERRINJ_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ECCRP_Bits.EDCERRINJ */
#define IFX_FLASH_ECCRP_EDCERRINJ_OFF (30u)

/** \brief  Length for Ifx_FLASH_ECCRP_Bits.RCODE */
#define IFX_FLASH_ECCRP_RCODE_LEN (22u)

/** \brief  Mask for Ifx_FLASH_ECCRP_Bits.RCODE */
#define IFX_FLASH_ECCRP_RCODE_MSK (0x3fffffu)

/** \brief  Offset for Ifx_FLASH_ECCRP_Bits.RCODE */
#define IFX_FLASH_ECCRP_RCODE_OFF (0u)

/** \brief  Length for Ifx_FLASH_ECCW_Bits.DECENCDIS */
#define IFX_FLASH_ECCW_DECENCDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ECCW_Bits.DECENCDIS */
#define IFX_FLASH_ECCW_DECENCDIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ECCW_Bits.DECENCDIS */
#define IFX_FLASH_ECCW_DECENCDIS_OFF (30u)

/** \brief  Length for Ifx_FLASH_ECCW_Bits.PECENCDIS */
#define IFX_FLASH_ECCW_PECENCDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ECCW_Bits.PECENCDIS */
#define IFX_FLASH_ECCW_PECENCDIS_MSK (0x1u)

