luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxFlash_bf.h
/** \brief  Offset for Ifx_FLASH_ECCW_Bits.PECENCDIS */
#define IFX_FLASH_ECCW_PECENCDIS_OFF (31u)

/** \brief  Length for Ifx_FLASH_ECCW_Bits.WCODE */
#define IFX_FLASH_ECCW_WCODE_LEN (22u)

/** \brief  Mask for Ifx_FLASH_ECCW_Bits.WCODE */
#define IFX_FLASH_ECCW_WCODE_MSK (0x3fffffu)

/** \brief  Offset for Ifx_FLASH_ECCW_Bits.WCODE */
#define IFX_FLASH_ECCW_WCODE_OFF (0u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.EOBM */
#define IFX_FLASH_FCON_EOBM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.EOBM */
#define IFX_FLASH_FCON_EOBM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.EOBM */
#define IFX_FLASH_FCON_EOBM_OFF (31u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.ESLDIS */
#define IFX_FLASH_FCON_ESLDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.ESLDIS */
#define IFX_FLASH_FCON_ESLDIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.ESLDIS */
#define IFX_FLASH_FCON_ESLDIS_OFF (16u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.IDLE */
#define IFX_FLASH_FCON_IDLE_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.IDLE */
#define IFX_FLASH_FCON_IDLE_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.IDLE */
#define IFX_FLASH_FCON_IDLE_OFF (15u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.NSAFECC */
#define IFX_FLASH_FCON_NSAFECC_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.NSAFECC */
#define IFX_FLASH_FCON_NSAFECC_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.NSAFECC */
#define IFX_FLASH_FCON_NSAFECC_OFF (18u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.PR5V */
#define IFX_FLASH_FCON_PR5V_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.PR5V */
#define IFX_FLASH_FCON_PR5V_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.PR5V */
#define IFX_FLASH_FCON_PR5V_OFF (30u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.PROERM */
#define IFX_FLASH_FCON_PROERM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.PROERM */
#define IFX_FLASH_FCON_PROERM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.PROERM */
#define IFX_FLASH_FCON_PROERM_OFF (26u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.RES21 */
#define IFX_FLASH_FCON_RES21_LEN (2u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.RES21 */
#define IFX_FLASH_FCON_RES21_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.RES21 */
#define IFX_FLASH_FCON_RES21_OFF (20u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.RES23 */
#define IFX_FLASH_FCON_RES23_LEN (2u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.RES23 */
#define IFX_FLASH_FCON_RES23_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.RES23 */
#define IFX_FLASH_FCON_RES23_OFF (22u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.SLEEP */
#define IFX_FLASH_FCON_SLEEP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.SLEEP */
#define IFX_FLASH_FCON_SLEEP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.SLEEP */
#define IFX_FLASH_FCON_SLEEP_OFF (17u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.SQERM */
#define IFX_FLASH_FCON_SQERM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.SQERM */
#define IFX_FLASH_FCON_SQERM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.SQERM */
#define IFX_FLASH_FCON_SQERM_OFF (25u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.STALL */
#define IFX_FLASH_FCON_STALL_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.STALL */
#define IFX_FLASH_FCON_STALL_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.STALL */
#define IFX_FLASH_FCON_STALL_OFF (19u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.VOPERM */
#define IFX_FLASH_FCON_VOPERM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.VOPERM */
#define IFX_FLASH_FCON_VOPERM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.VOPERM */
#define IFX_FLASH_FCON_VOPERM_OFF (24u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.WSDFLASH */
#define IFX_FLASH_FCON_WSDFLASH_LEN (6u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.WSDFLASH */
#define IFX_FLASH_FCON_WSDFLASH_MSK (0x3fu)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.WSDFLASH */
#define IFX_FLASH_FCON_WSDFLASH_OFF (6u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.WSECDF */
#define IFX_FLASH_FCON_WSECDF_LEN (3u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.WSECDF */
#define IFX_FLASH_FCON_WSECDF_MSK (0x7u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.WSECDF */
#define IFX_FLASH_FCON_WSECDF_OFF (12u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.WSECPF */
#define IFX_FLASH_FCON_WSECPF_LEN (2u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.WSECPF */
#define IFX_FLASH_FCON_WSECPF_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.WSECPF */
#define IFX_FLASH_FCON_WSECPF_OFF (4u)

/** \brief  Length for Ifx_FLASH_FCON_Bits.WSPFLASH */
#define IFX_FLASH_FCON_WSPFLASH_LEN (4u)

/** \brief  Mask for Ifx_FLASH_FCON_Bits.WSPFLASH */
#define IFX_FLASH_FCON_WSPFLASH_MSK (0xfu)

/** \brief  Offset for Ifx_FLASH_FCON_Bits.WSPFLASH */
#define IFX_FLASH_FCON_WSPFLASH_OFF (0u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.DCFP */
#define IFX_FLASH_FPRO_DCFP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.DCFP */
#define IFX_FLASH_FPRO_DCFP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.DCFP */
#define IFX_FLASH_FPRO_DCFP_OFF (16u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.DDFD */
#define IFX_FLASH_FPRO_DDFD_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.DDFD */
#define IFX_FLASH_FPRO_DDFD_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.DDFD */
#define IFX_FLASH_FPRO_DDFD_OFF (20u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.DDFP */
#define IFX_FLASH_FPRO_DDFP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.DDFP */
#define IFX_FLASH_FPRO_DDFP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.DDFP */
#define IFX_FLASH_FPRO_DDFP_OFF (17u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.DDFPX */
#define IFX_FLASH_FPRO_DDFPX_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.DDFPX */
#define IFX_FLASH_FPRO_DDFPX_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.DDFPX */
#define IFX_FLASH_FPRO_DDFPX_OFF (18u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.ENPE */
#define IFX_FLASH_FPRO_ENPE_LEN (2u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.ENPE */
#define IFX_FLASH_FPRO_ENPE_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.ENPE */
#define IFX_FLASH_FPRO_ENPE_OFF (22u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.PRODISD */
#define IFX_FLASH_FPRO_PRODISD_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.PRODISD */
#define IFX_FLASH_FPRO_PRODISD_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.PRODISD */
#define IFX_FLASH_FPRO_PRODISD_OFF (3u)

