luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxFlash_bf.h
/** \brief  Offset for Ifx_FLASH_FSR_Bits.ORIER */
#define IFX_FLASH_FSR_ORIER_OFF (30u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.P0BUSY */
#define IFX_FLASH_FSR_P0BUSY_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.P0BUSY */
#define IFX_FLASH_FSR_P0BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.P0BUSY */
#define IFX_FLASH_FSR_P0BUSY_OFF (3u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.P1BUSY */
#define IFX_FLASH_FSR_P1BUSY_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.P1BUSY */
#define IFX_FLASH_FSR_P1BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.P1BUSY */
#define IFX_FLASH_FSR_P1BUSY_OFF (4u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.PFDBER */
#define IFX_FLASH_FSR_PFDBER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.PFDBER */
#define IFX_FLASH_FSR_PFDBER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.PFDBER */
#define IFX_FLASH_FSR_PFDBER_OFF (15u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.PFMBER */
#define IFX_FLASH_FSR_PFMBER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.PFMBER */
#define IFX_FLASH_FSR_PFMBER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.PFMBER */
#define IFX_FLASH_FSR_PFMBER_OFF (16u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.PFPAGE */
#define IFX_FLASH_FSR_PFPAGE_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.PFPAGE */
#define IFX_FLASH_FSR_PFPAGE_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.PFPAGE */
#define IFX_FLASH_FSR_PFPAGE_OFF (9u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.PFSBER */
#define IFX_FLASH_FSR_PFSBER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.PFSBER */
#define IFX_FLASH_FSR_PFSBER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.PFSBER */
#define IFX_FLASH_FSR_PFSBER_OFF (14u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.PROER */
#define IFX_FLASH_FSR_PROER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.PROER */
#define IFX_FLASH_FSR_PROER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.PROER */
#define IFX_FLASH_FSR_PROER_OFF (13u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.PROG */
#define IFX_FLASH_FSR_PROG_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.PROG */
#define IFX_FLASH_FSR_PROG_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.PROG */
#define IFX_FLASH_FSR_PROG_OFF (7u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.PVER */
#define IFX_FLASH_FSR_PVER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.PVER */
#define IFX_FLASH_FSR_PVER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.PVER */
#define IFX_FLASH_FSR_PVER_OFF (25u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.RES17 */
#define IFX_FLASH_FSR_RES17_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.RES17 */
#define IFX_FLASH_FSR_RES17_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.RES17 */
#define IFX_FLASH_FSR_RES17_OFF (17u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.RES5 */
#define IFX_FLASH_FSR_RES5_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.RES5 */
#define IFX_FLASH_FSR_RES5_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.RES5 */
#define IFX_FLASH_FSR_RES5_OFF (5u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.RES6 */
#define IFX_FLASH_FSR_RES6_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.RES6 */
#define IFX_FLASH_FSR_RES6_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.RES6 */
#define IFX_FLASH_FSR_RES6_OFF (6u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.SLM */
#define IFX_FLASH_FSR_SLM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.SLM */
#define IFX_FLASH_FSR_SLM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.SLM */
#define IFX_FLASH_FSR_SLM_OFF (28u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.SPND */
#define IFX_FLASH_FSR_SPND_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.SPND */
#define IFX_FLASH_FSR_SPND_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.SPND */
#define IFX_FLASH_FSR_SPND_OFF (27u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.SQER */
#define IFX_FLASH_FSR_SQER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.SQER */
#define IFX_FLASH_FSR_SQER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.SQER */
#define IFX_FLASH_FSR_SQER_OFF (12u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.SRIADDERR */
#define IFX_FLASH_FSR_SRIADDERR_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.SRIADDERR */
#define IFX_FLASH_FSR_SRIADDERR_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.SRIADDERR */
#define IFX_FLASH_FSR_SRIADDERR_OFF (22u)

/** \brief  Length for Ifx_FLASH_HSMFCON_Bits.EOBM */
#define IFX_FLASH_HSMFCON_EOBM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFCON_Bits.EOBM */
#define IFX_FLASH_HSMFCON_EOBM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMFCON_Bits.EOBM */
#define IFX_FLASH_HSMFCON_EOBM_OFF (31u)

/** \brief  Length for Ifx_FLASH_HSMFCON_Bits.LCKHSMUCB */
#define IFX_FLASH_HSMFCON_LCKHSMUCB_LEN (2u)

/** \brief  Mask for Ifx_FLASH_HSMFCON_Bits.LCKHSMUCB */
#define IFX_FLASH_HSMFCON_LCKHSMUCB_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_HSMFCON_Bits.LCKHSMUCB */
#define IFX_FLASH_HSMFCON_LCKHSMUCB_OFF (0u)

/** \brief  Length for Ifx_FLASH_HSMFCON_Bits.SQERM */
#define IFX_FLASH_HSMFCON_SQERM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFCON_Bits.SQERM */
#define IFX_FLASH_HSMFCON_SQERM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMFCON_Bits.SQERM */
#define IFX_FLASH_HSMFCON_SQERM_OFF (25u)

/** \brief  Length for Ifx_FLASH_HSMFCON_Bits.VOPERM */
#define IFX_FLASH_HSMFCON_VOPERM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFCON_Bits.VOPERM */
#define IFX_FLASH_HSMFCON_VOPERM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMFCON_Bits.VOPERM */
#define IFX_FLASH_HSMFCON_VOPERM_OFF (24u)

/** \brief  Length for Ifx_FLASH_HSMFSR_Bits.D1BUSY */
#define IFX_FLASH_HSMFSR_D1BUSY_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFSR_Bits.D1BUSY */
#define IFX_FLASH_HSMFSR_D1BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMFSR_Bits.D1BUSY */
#define IFX_FLASH_HSMFSR_D1BUSY_OFF (2u)

/** \brief  Length for Ifx_FLASH_HSMFSR_Bits.DFPAGE */
#define IFX_FLASH_HSMFSR_DFPAGE_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFSR_Bits.DFPAGE */
#define IFX_FLASH_HSMFSR_DFPAGE_MSK (0x1u)

