luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxFlash_bf.h
/** \brief  Length for Ifx_FLASH_ID_Bits.MOD_TYPE */
#define IFX_FLASH_ID_MOD_TYPE_LEN (8u)

/** \brief  Mask for Ifx_FLASH_ID_Bits.MOD_TYPE */
#define IFX_FLASH_ID_MOD_TYPE_MSK (0xffu)

/** \brief  Offset for Ifx_FLASH_ID_Bits.MOD_TYPE */
#define IFX_FLASH_ID_MOD_TYPE_OFF (8u)

/** \brief  Length for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_OFF (0u)

/** \brief  Length for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_OFF (1u)

/** \brief  Length for Ifx_FLASH_MARD_Bits.SPND */
#define IFX_FLASH_MARD_SPND_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARD_Bits.SPND */
#define IFX_FLASH_MARD_SPND_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARD_Bits.SPND */
#define IFX_FLASH_MARD_SPND_OFF (3u)

/** \brief  Length for Ifx_FLASH_MARD_Bits.SPNDERR */
#define IFX_FLASH_MARD_SPNDERR_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARD_Bits.SPNDERR */
#define IFX_FLASH_MARD_SPNDERR_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARD_Bits.SPNDERR */
#define IFX_FLASH_MARD_SPNDERR_OFF (4u)

/** \brief  Length for Ifx_FLASH_MARD_Bits.TRAPDIS */
#define IFX_FLASH_MARD_TRAPDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARD_Bits.TRAPDIS */
#define IFX_FLASH_MARD_TRAPDIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARD_Bits.TRAPDIS */
#define IFX_FLASH_MARD_TRAPDIS_OFF (15u)

/** \brief  Length for Ifx_FLASH_MARP_Bits.RES2 */
#define IFX_FLASH_MARP_RES2_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARP_Bits.RES2 */
#define IFX_FLASH_MARP_RES2_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARP_Bits.RES2 */
#define IFX_FLASH_MARP_RES2_OFF (2u)

/** \brief  Length for Ifx_FLASH_MARP_Bits.RES3 */
#define IFX_FLASH_MARP_RES3_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARP_Bits.RES3 */
#define IFX_FLASH_MARP_RES3_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARP_Bits.RES3 */
#define IFX_FLASH_MARP_RES3_OFF (3u)

/** \brief  Length for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_OFF (0u)

/** \brief  Length for Ifx_FLASH_MARP_Bits.SELP1 */
#define IFX_FLASH_MARP_SELP1_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARP_Bits.SELP1 */
#define IFX_FLASH_MARP_SELP1_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARP_Bits.SELP1 */
#define IFX_FLASH_MARP_SELP1_OFF (1u)

/** \brief  Length for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_OFF (15u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.APREN */
#define IFX_FLASH_PROCOND_APREN_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.APREN */
#define IFX_FLASH_PROCOND_APREN_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.APREN */
#define IFX_FLASH_PROCOND_APREN_OFF (11u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.CAP0EN */
#define IFX_FLASH_PROCOND_CAP0EN_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP0EN */
#define IFX_FLASH_PROCOND_CAP0EN_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP0EN */
#define IFX_FLASH_PROCOND_CAP0EN_OFF (12u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.CAP1EN */
#define IFX_FLASH_PROCOND_CAP1EN_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP1EN */
#define IFX_FLASH_PROCOND_CAP1EN_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP1EN */
#define IFX_FLASH_PROCOND_CAP1EN_OFF (13u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.CAP2EN */
#define IFX_FLASH_PROCOND_CAP2EN_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP2EN */
#define IFX_FLASH_PROCOND_CAP2EN_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP2EN */
#define IFX_FLASH_PROCOND_CAP2EN_OFF (14u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.CAP3EN */
#define IFX_FLASH_PROCOND_CAP3EN_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP3EN */
#define IFX_FLASH_PROCOND_CAP3EN_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP3EN */
#define IFX_FLASH_PROCOND_CAP3EN_OFF (15u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.ESR0CNT */
#define IFX_FLASH_PROCOND_ESR0CNT_LEN (12u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.ESR0CNT */
#define IFX_FLASH_PROCOND_ESR0CNT_MSK (0xfffu)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.ESR0CNT */
#define IFX_FLASH_PROCOND_ESR0CNT_OFF (16u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_OFF (0u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.MODE */
#define IFX_FLASH_PROCOND_MODE_LEN (2u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.MODE */
#define IFX_FLASH_PROCOND_MODE_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.MODE */
#define IFX_FLASH_PROCOND_MODE_OFF (9u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.NSAFECC */
#define IFX_FLASH_PROCOND_NSAFECC_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.NSAFECC */
#define IFX_FLASH_PROCOND_NSAFECC_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.NSAFECC */
#define IFX_FLASH_PROCOND_NSAFECC_OFF (1u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.OSCCFG */
#define IFX_FLASH_PROCOND_OSCCFG_LEN (1u)

