luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxFlash_bf.h
/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.HSMENPINS */
#define IFX_FLASH_PROCONHSMCOTP_HSMENPINS_LEN (2u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.HSMENPINS */
#define IFX_FLASH_PROCONHSMCOTP_HSMENPINS_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_PROCONHSMCOTP_Bits.HSMENPINS */
#define IFX_FLASH_PROCONHSMCOTP_HSMENPINS_OFF (7u)

/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.HSMENRES */
#define IFX_FLASH_PROCONHSMCOTP_HSMENRES_LEN (2u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.HSMENRES */
#define IFX_FLASH_PROCONHSMCOTP_HSMENRES_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_PROCONHSMCOTP_Bits.HSMENRES */
#define IFX_FLASH_PROCONHSMCOTP_HSMENRES_OFF (9u)

/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.S16ROM */
#define IFX_FLASH_PROCONHSMCOTP_S16ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.S16ROM */
#define IFX_FLASH_PROCONHSMCOTP_S16ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONHSMCOTP_Bits.S16ROM */
#define IFX_FLASH_PROCONHSMCOTP_S16ROM_OFF (16u)

/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.S17ROM */
#define IFX_FLASH_PROCONHSMCOTP_S17ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.S17ROM */
#define IFX_FLASH_PROCONHSMCOTP_S17ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONHSMCOTP_Bits.S17ROM */
#define IFX_FLASH_PROCONHSMCOTP_S17ROM_OFF (17u)

/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONHSMCOTP_S6ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONHSMCOTP_S6ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONHSMCOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONHSMCOTP_S6ROM_OFF (6u)

/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.SSWWAIT */
#define IFX_FLASH_PROCONHSMCOTP_SSWWAIT_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.SSWWAIT */
#define IFX_FLASH_PROCONHSMCOTP_SSWWAIT_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONHSMCOTP_Bits.SSWWAIT */
#define IFX_FLASH_PROCONHSMCOTP_SSWWAIT_OFF (1u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.BML */
#define IFX_FLASH_PROCONOTP_BML_LEN (2u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.BML */
#define IFX_FLASH_PROCONOTP_BML_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.BML */
#define IFX_FLASH_PROCONOTP_BML_OFF (29u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S0ROM */
#define IFX_FLASH_PROCONOTP_S0ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S0ROM */
#define IFX_FLASH_PROCONOTP_S0ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S0ROM */
#define IFX_FLASH_PROCONOTP_S0ROM_OFF (0u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S10ROM */
#define IFX_FLASH_PROCONOTP_S10ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S10ROM */
#define IFX_FLASH_PROCONOTP_S10ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S10ROM */
#define IFX_FLASH_PROCONOTP_S10ROM_OFF (10u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S11ROM */
#define IFX_FLASH_PROCONOTP_S11ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S11ROM */
#define IFX_FLASH_PROCONOTP_S11ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S11ROM */
#define IFX_FLASH_PROCONOTP_S11ROM_OFF (11u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S12ROM */
#define IFX_FLASH_PROCONOTP_S12ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S12ROM */
#define IFX_FLASH_PROCONOTP_S12ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S12ROM */
#define IFX_FLASH_PROCONOTP_S12ROM_OFF (12u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S13ROM */
#define IFX_FLASH_PROCONOTP_S13ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S13ROM */
#define IFX_FLASH_PROCONOTP_S13ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S13ROM */
#define IFX_FLASH_PROCONOTP_S13ROM_OFF (13u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S14ROM */
#define IFX_FLASH_PROCONOTP_S14ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S14ROM */
#define IFX_FLASH_PROCONOTP_S14ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S14ROM */
#define IFX_FLASH_PROCONOTP_S14ROM_OFF (14u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S15ROM */
#define IFX_FLASH_PROCONOTP_S15ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S15ROM */
#define IFX_FLASH_PROCONOTP_S15ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S15ROM */
#define IFX_FLASH_PROCONOTP_S15ROM_OFF (15u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S16ROM */
#define IFX_FLASH_PROCONOTP_S16ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S16ROM */
#define IFX_FLASH_PROCONOTP_S16ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S16ROM */
#define IFX_FLASH_PROCONOTP_S16ROM_OFF (16u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S17ROM */
#define IFX_FLASH_PROCONOTP_S17ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S17ROM */
#define IFX_FLASH_PROCONOTP_S17ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S17ROM */
#define IFX_FLASH_PROCONOTP_S17ROM_OFF (17u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S18ROM */
#define IFX_FLASH_PROCONOTP_S18ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S18ROM */
#define IFX_FLASH_PROCONOTP_S18ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S18ROM */
#define IFX_FLASH_PROCONOTP_S18ROM_OFF (18u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S19ROM */
#define IFX_FLASH_PROCONOTP_S19ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S19ROM */
#define IFX_FLASH_PROCONOTP_S19ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S19ROM */
#define IFX_FLASH_PROCONOTP_S19ROM_OFF (19u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S1ROM */
#define IFX_FLASH_PROCONOTP_S1ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S1ROM */
#define IFX_FLASH_PROCONOTP_S1ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S1ROM */
#define IFX_FLASH_PROCONOTP_S1ROM_OFF (1u)

