luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxFlash_bf.h
/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S8L */
#define IFX_FLASH_PROCONP_S8L_OFF (8u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S9L */
#define IFX_FLASH_PROCONP_S9L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S9L */
#define IFX_FLASH_PROCONP_S9L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S9L */
#define IFX_FLASH_PROCONP_S9L_OFF (9u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.DATM */
#define IFX_FLASH_PROCONWOP_DATM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.DATM */
#define IFX_FLASH_PROCONWOP_DATM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.DATM */
#define IFX_FLASH_PROCONWOP_DATM_OFF (31u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S0WOP */
#define IFX_FLASH_PROCONWOP_S0WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S0WOP */
#define IFX_FLASH_PROCONWOP_S0WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S0WOP */
#define IFX_FLASH_PROCONWOP_S0WOP_OFF (0u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S10WOP */
#define IFX_FLASH_PROCONWOP_S10WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S10WOP */
#define IFX_FLASH_PROCONWOP_S10WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S10WOP */
#define IFX_FLASH_PROCONWOP_S10WOP_OFF (10u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S11WOP */
#define IFX_FLASH_PROCONWOP_S11WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S11WOP */
#define IFX_FLASH_PROCONWOP_S11WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S11WOP */
#define IFX_FLASH_PROCONWOP_S11WOP_OFF (11u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S12WOP */
#define IFX_FLASH_PROCONWOP_S12WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S12WOP */
#define IFX_FLASH_PROCONWOP_S12WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S12WOP */
#define IFX_FLASH_PROCONWOP_S12WOP_OFF (12u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S13WOP */
#define IFX_FLASH_PROCONWOP_S13WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S13WOP */
#define IFX_FLASH_PROCONWOP_S13WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S13WOP */
#define IFX_FLASH_PROCONWOP_S13WOP_OFF (13u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S14WOP */
#define IFX_FLASH_PROCONWOP_S14WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S14WOP */
#define IFX_FLASH_PROCONWOP_S14WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S14WOP */
#define IFX_FLASH_PROCONWOP_S14WOP_OFF (14u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S15WOP */
#define IFX_FLASH_PROCONWOP_S15WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S15WOP */
#define IFX_FLASH_PROCONWOP_S15WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S15WOP */
#define IFX_FLASH_PROCONWOP_S15WOP_OFF (15u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S16WOP */
#define IFX_FLASH_PROCONWOP_S16WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S16WOP */
#define IFX_FLASH_PROCONWOP_S16WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S16WOP */
#define IFX_FLASH_PROCONWOP_S16WOP_OFF (16u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S17WOP */
#define IFX_FLASH_PROCONWOP_S17WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S17WOP */
#define IFX_FLASH_PROCONWOP_S17WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S17WOP */
#define IFX_FLASH_PROCONWOP_S17WOP_OFF (17u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S18WOP */
#define IFX_FLASH_PROCONWOP_S18WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S18WOP */
#define IFX_FLASH_PROCONWOP_S18WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S18WOP */
#define IFX_FLASH_PROCONWOP_S18WOP_OFF (18u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S19WOP */
#define IFX_FLASH_PROCONWOP_S19WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S19WOP */
#define IFX_FLASH_PROCONWOP_S19WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S19WOP */
#define IFX_FLASH_PROCONWOP_S19WOP_OFF (19u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S1WOP */
#define IFX_FLASH_PROCONWOP_S1WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S1WOP */
#define IFX_FLASH_PROCONWOP_S1WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S1WOP */
#define IFX_FLASH_PROCONWOP_S1WOP_OFF (1u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S20WOP */
#define IFX_FLASH_PROCONWOP_S20WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S20WOP */
#define IFX_FLASH_PROCONWOP_S20WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S20WOP */
#define IFX_FLASH_PROCONWOP_S20WOP_OFF (20u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S21WOP */
#define IFX_FLASH_PROCONWOP_S21WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S21WOP */
#define IFX_FLASH_PROCONWOP_S21WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S21WOP */
#define IFX_FLASH_PROCONWOP_S21WOP_OFF (21u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S22WOP */
#define IFX_FLASH_PROCONWOP_S22WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S22WOP */
#define IFX_FLASH_PROCONWOP_S22WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S22WOP */
#define IFX_FLASH_PROCONWOP_S22WOP_OFF (22u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S23WOP */
#define IFX_FLASH_PROCONWOP_S23WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S23WOP */
#define IFX_FLASH_PROCONWOP_S23WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S23WOP */
#define IFX_FLASH_PROCONWOP_S23WOP_OFF (23u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S24WOP */
#define IFX_FLASH_PROCONWOP_S24WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S24WOP */
#define IFX_FLASH_PROCONWOP_S24WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S24WOP */
#define IFX_FLASH_PROCONWOP_S24WOP_OFF (24u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S25WOP */
#define IFX_FLASH_PROCONWOP_S25WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S25WOP */
#define IFX_FLASH_PROCONWOP_S25WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S25WOP */
#define IFX_FLASH_PROCONWOP_S25WOP_OFF (25u)

