luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxFlash_bf.h
/** \brief  Mask for Ifx_FLASH_RRD1_Bits.DATA */
#define IFX_FLASH_RRD1_DATA_MSK (0xffffffffu)

/** \brief  Offset for Ifx_FLASH_RRD1_Bits.DATA */
#define IFX_FLASH_RRD1_DATA_OFF (0u)

/** \brief  Length for Ifx_FLASH_UBAB_CFG_Bits.CLR */
#define IFX_FLASH_UBAB_CFG_CLR_LEN (1u)

/** \brief  Mask for Ifx_FLASH_UBAB_CFG_Bits.CLR */
#define IFX_FLASH_UBAB_CFG_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_UBAB_CFG_Bits.CLR */
#define IFX_FLASH_UBAB_CFG_CLR_OFF (8u)

/** \brief  Length for Ifx_FLASH_UBAB_CFG_Bits.DIS */
#define IFX_FLASH_UBAB_CFG_DIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_UBAB_CFG_Bits.DIS */
#define IFX_FLASH_UBAB_CFG_DIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_UBAB_CFG_Bits.DIS */
#define IFX_FLASH_UBAB_CFG_DIS_OFF (9u)

/** \brief  Length for Ifx_FLASH_UBAB_CFG_Bits.SEL */
#define IFX_FLASH_UBAB_CFG_SEL_LEN (6u)

/** \brief  Mask for Ifx_FLASH_UBAB_CFG_Bits.SEL */
#define IFX_FLASH_UBAB_CFG_SEL_MSK (0x3fu)

/** \brief  Offset for Ifx_FLASH_UBAB_CFG_Bits.SEL */
#define IFX_FLASH_UBAB_CFG_SEL_OFF (0u)

/** \brief  Length for Ifx_FLASH_UBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_UBAB_STAT_VLD0_LEN (1u)

/** \brief  Mask for Ifx_FLASH_UBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_UBAB_STAT_VLD0_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_UBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_UBAB_STAT_VLD0_OFF (0u)

/** \brief  Length for Ifx_FLASH_UBAB_TOP_Bits.ADDR */
#define IFX_FLASH_UBAB_TOP_ADDR_LEN (19u)

/** \brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.ADDR */
#define IFX_FLASH_UBAB_TOP_ADDR_MSK (0x7ffffu)

/** \brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.ADDR */
#define IFX_FLASH_UBAB_TOP_ADDR_OFF (5u)

/** \brief  Length for Ifx_FLASH_UBAB_TOP_Bits.CLR */
#define IFX_FLASH_UBAB_TOP_CLR_LEN (1u)

/** \brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.CLR */
#define IFX_FLASH_UBAB_TOP_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.CLR */
#define IFX_FLASH_UBAB_TOP_CLR_OFF (31u)

/** \brief  Length for Ifx_FLASH_UBAB_TOP_Bits.ERR */
#define IFX_FLASH_UBAB_TOP_ERR_LEN (6u)

/** \brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.ERR */
#define IFX_FLASH_UBAB_TOP_ERR_MSK (0x3fu)

/** \brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.ERR */
#define IFX_FLASH_UBAB_TOP_ERR_OFF (24u)

/** \brief  Length for Ifx_FLASH_UBAB_TOP_Bits.VLD */
#define IFX_FLASH_UBAB_TOP_VLD_LEN (1u)

/** \brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.VLD */
#define IFX_FLASH_UBAB_TOP_VLD_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.VLD */
#define IFX_FLASH_UBAB_TOP_VLD_OFF (30u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXFLASH_BF_H */
